RIOT-OS/RIOT/cpu/stm32f4/include/cpu_conf.h
/*
 * Copyright (C) 2014 Freie Universität Berlin
 *
 * This file is subject to the terms and conditions of the GNU Lesser General
 * Public License v2.1. See the file LICENSE in the top level directory for more
 * details.
 */

/**
 * @defgroup        cpu_stm32f4 STM32F4
 * @ingroup         cpu
 * @brief           CPU specific implementations for the STM32F4
 * @{
 *
 * @file
 * @brief           Implementation specific CPU configuration options
 *
 * @author          Hauke Petersen <hauke.petersen@fu-berlin.de>
 */

#ifndef STM32F4_CPU_CONF_H
#define STM32F4_CPU_CONF_H

#include "cpu_conf_common.h"

#if defined(CPU_MODEL_STM32F401RE)
#include "vendor/stm32f401xe.h"
#elif defined(CPU_MODEL_STM32F407VG)
#include "vendor/stm32f407xx.h"
#elif defined(CPU_MODEL_STM32F410RB)
#include "vendor/stm32f410rx.h"
#elif defined(CPU_MODEL_STM32F411RE)
#include "vendor/stm32f411xe.h"
#elif defined(CPU_MODEL_STM32F413ZH)
#include "vendor/stm32f413xx.h"
#elif defined(CPU_MODEL_STM32F415RG)
#include "vendor/stm32f415xx.h"
#elif defined(CPU_MODEL_STM32F446RE) || defined(CPU_MODEL_STM32F446ZE)
#include "vendor/stm32f446xx.h"
#elif defined(CPU_MODEL_STM32F429ZI)
#include "vendor/stm32f429xx.h"
#endif

#ifdef __cplusplus
extern "C" {
#endif

/**
 * @brief   Flash sector configuration
 * @{
 */
#if defined(CPU_MODEL_STM32F401RE)
#define FLASHSECTOR_SMALL_SECTOR    (16U)
#define FLASHSECTOR_BANK_SIZE       (512U)
#define FLASHSECTOR_NUMOF           (8U)
#elif defined(CPU_MODEL_STM32F407VG)
#define FLASHSECTOR_SMALL_SECTOR    (16U)
#define FLASHSECTOR_BANK_SIZE       (1024U)
#define FLASHSECTOR_NUMOF           (12U)
#elif defined(CPU_MODEL_STM32F411RE)
#define FLASHSECTOR_SMALL_SECTOR    (16U)
#define FLASHSECTOR_BANK_SIZE       (512U)
#define FLASHSECTOR_NUMOF           (8U)
#elif defined(CPU_MODEL_STM32F413ZH)
#define FLASHSECTOR_SMALL_SECTOR    (16U)
#define FLASHSECTOR_BANK_SIZE       (1536U)
#define FLASHSECTOR_NUMOF           (16U)
#elif defined(CPU_MODEL_STM32F415RG)
#define FLASHSECTOR_SMALL_SECTOR    (16U)
#define FLASHSECTOR_BANK_SIZE       (1024U)
#define FLASHSECTOR_NUMOF           (12U)
#elif defined(CPU_MODEL_STM32F446RE)
#define FLASHSECTOR_SMALL_SECTOR    (16U)
#define FLASHSECTOR_BANK_SIZE       (512U)
#define FLASHSECTOR_NUMOF           (8U)
#endif
/** @} */

/**
 * @brief   ARM Cortex-M specific CPU configuration
 * @{
 */
#define CPU_DEFAULT_IRQ_PRIO            (1U)
#define CPU_IRQ_NUMOF                   (82U)
#define CPU_FLASH_BASE                  FLASH_BASE
/** @} */

#ifdef __cplusplus
}
#endif

#endif /* STM32F4_CPU_CONF_H */
/** @} */
